<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Beamer disk image and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.joergflorin.munki.Beamer</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Beamer</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/beamer</string>
        <key>DESCRIPTION</key>
        <string>Streamen von Videos über Airplay.</string>
        <key>DISPLAY_NAME</key>
        <string>%NAME%</string>
        <key>DEVELOPER</key>
        <string>Tupil B.V.</string>
        <key>CATEGORY</key>
        <string>Unterhaltung</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>%DESCRIPTION%</string>
			<key>display_name</key>
			<string>%DISPLAY_NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>developer</key>
			<string>%DEVELOPER%</string>
			<key>category</key>
			<string>%CATEGORY%</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.0</string>
	<key>ParentRecipe</key>
	<string>com.github.joergflorin.download.Beamer</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
            <string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/%NAME%.app/Contents/Info.plist</string>
			</dict>
		</dict>
		<dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
		</dict>
		<dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>version_comparison_key</key>
				<string>CFBundleVersion</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
