<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Automap installer package and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.joergflorin.munki.Automap</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Automap</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/novation</string>
        <key>DESCRIPTION</key>
        <string>Die Automap-Software wird mit allen Novation-Controllern mitgeliefert und wurde entwickelt, um die Zuweisung von Hardware-Controllern zu verschiedenen Software-Parametern schneller und einfacher zu machen.</string>
        <key>DISPLAY_NAME</key>
        <string>%NAME%</string>
        <key>DEVELOPER</key>
        <string>Focusrite Novation</string>
        <key>CATEGORY</key>
        <string>Musik</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>%DESCRIPTION%</string>
			<key>display_name</key>
			<string>%DISPLAY_NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>developer</key>
			<string>%DEVELOPER%</string>
			<key>category</key>
			<string>%CATEGORY%</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.0</string>
	<key>ParentRecipe</key>
	<string>com.github.joergflorin.download.Automap</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>version_comparison_key</key>
				<string>CFBundleVersion</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
