<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Automap image.</string>
    <key>Identifier</key>
    <string>com.github.joergflorin.download.Automap</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Automap</string>
        <key>SEARCH_URL</key>
        <string>http://global.novationmusic.com/support/product-downloads?product=Automap</string>
        <key>SEARCH_PATTERN</key>
        <string>(http:\/\/[\w]+\.cloudfront.net\/sites\/default\/files\/novation\/downloads\/[0-9]+\/automap-[0-9\.]+\.dmg)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
             </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
